app/controllers/movies_controller.rb

  def show
    @movie = Movie.find(params[:id])
---
SELECT * FROM `movies` WHERE (`movies`.`id` = 1250)